[
  {
    "id": "a1cb37db64cee52c66f99510",
    "name": "Axes",
    "description": "Axes are a Weapon Category in Dark Souls and Dark Souls Remastered. Axes are weapons with a wide medium-range arc attack motion. They provide hard hitting attacks that deal very high damage at the expense of swing speed. Larger axes require players to consider each attack wisely, as missing will leave you open to enemy counters. Its wide arc swing makes it unsuitable for use in small confined spaces as attacks get interrupted when hitting a wall. ",
    "image": "hand_axe.png",
    "weapons": [
      "9c95ece9-cf7e-4216-9325-fd9b581020da",
      "1cd9d4d6-2e27-4c07-997a-f94984ab8a0f",
      "6514c6d4-7ae7-4791-9108-b244b65b8607",
      "3bb0ef43-d848-4756-98c6-0f829d76039f",
      "6c9dbc5d-af1d-45de-a48d-948ae12b4b1e",
      "dac58662-1ad5-4bcd-856e-57289627568d"
    ],
    "slug": "axes"
  },
  {
    "id": "b1cb37db64cee52c66f99510",
    "name": "Bows",
    "description": "Bows are a Weapon Category in Dark Souls and Dark Souls Remastered. Bows are long-ranged weapons that necessitate Arrows to function and possess no melee capability. There are 2 types of bows; short bows and long bows, each with their own unique firing animations and mechanics. Short bows are well suited for PvP as they have a high firing rate (High Damage Per Second). Long bows are well suited for PvE, where they can snipe an opponents from long and safe distance. Reloading is slower for longbows, making them less adequate for closer enemies such as PvP. These weapon scale well with Dexterity.",
    "image": "black_bow_of_pharis.png",
    "weapons": [
      "cf60c22b-f9e1-4f84-b8a3-109067c0fee3",
      "a487ba2d-770b-457c-a349-8a31fdd2a9d2",
      "c76bf062-403d-40bd-b410-f2731587d88f",
      "6ac31b7a-94a4-4907-9d56-07c274d38aba",
      "6298e2ff-be11-4a3f-a524-f4c5a08a27c1",
      "7efc17ba-8599-4929-8cac-b5ec17b2bea1",
      "c6355e8c-19a8-486c-a102-4ee9c22118c6"
    ],
    "slug": "bows"
  },
  {
    "id": "c1cb37db64cee52c66f99510",
    "name": "Crossbows",
    "description": "Crossbows are a Weapon Category in Dark Souls and Dark Souls Remastered. Crossbows are ranged weapons that use bolts for ammunition, granting players the ability to modify elemental damage accordingly. They do not have a zoomed-in aiming capability like bows but can deal higher damage. Crossbows deliver thrust damage that is compounded with critical when the wielder pulls off a headshot, and can be used in melee combat by shooting from the hip. Crossbows have no stat scaling, leaving players to focus on elemental upgrades.",
    "image": "light_crossbow.png",
    "weapons": [
      "0bec4379-e288-45d5-b5b7-636e394de638",
      "6ce8dd4d-c26d-4978-8897-f628e9c19a60",
      "c3c3fda0-8650-4568-961a-0d7c342c9c3c",
      "9d8206d5-f961-4f1c-b76f-d0fef1d5e7dc"
    ],
    "slug": "crossbows"
  },
  {
    "id": "d1cb37db64cee52c66f99510",
    "name": "Curved Greatswords",
    "description": "Curved Greatswords are a Weapon Category in Dark Souls and Dark Souls Remastered. Curved Greatswords are larger than Curved swords and are meant to be wielded two-handed due to their inherent weight and Strength requirements. Curved Greatswords generally have the highest attack rating among the Dexterity-based weapons and compliment it with excellent reach, good combo ability and heavy Poise damage. Their sweeping motions make them well-suited for attacking groups of enemies.",
    "image": "murakumo.png",
    "weapons": [
      "70d11e15-9d0e-43ca-a8ea-d90219249295",
      "6b849ed8-b4f2-418e-8c0b-7d2c29534a81",
      "d68ff6af-db20-478a-8e89-a71eb4837279"
    ],
    "slug": "curved-greatswords"
  },
  {
    "id": "e1cb37db64cee52c66f99510",
    "name": "Curved Swords",
    "description": "Curved Swords are a Weapon Category in Dark Souls and Dark Souls Remastered. Curved Swords are fast, medium range weapons similar to Straight Swords but are focused on Dexterity Scaling, and feature a fluid moveset. Most of these weapon have 2 basic damage types: slash and thrust. They are suitable for narrow spaces as enemies will have trouble moving around to dodge or block the fast moving attacks. All Curved Swords kick moveset is replaced with an evasive slash attack that causes the wielder to flip away. Curved Swords are also a great option for those wanting to apply buffs Darkmoon Blade or Rotten Pine Resin.",
    "image": "quelaags_furysword.png",
    "weapons": [
      "fda454fb-2acd-43d0-be05-2cc0465e405b",
      "18a67d0f-7680-4fc4-b576-936adf66767f",
      "12721adc-e58c-49fb-915b-5d108dfea543",
      "aa6c2c50-ff93-4541-92b4-303c5c8451b6",
      "b2f737b9-0865-4eec-aecd-2bcdf63e73c6",
      "f39adea5-2da3-4060-ac46-41fbe6e2bb61",
      "ff6643f5-bb74-4f57-b6f6-d2c78a4401ff"
    ],
    "slug": "curved-swords"
  },
  {
    "id": "f1cb37db64cee52c66f99510",
    "name": "Daggers",
    "description": "Daggers are a Weapon Category in Dark Souls and Dark Souls Remastered. Daggers deliver fast and precise attacks, enabling players to dodge and land successive strikes leading to staggering of the enemy even in close quarters due to their short reach. These weapons have two basic Damage Types: Thrust and Slash. They generally have good Dexterity Scaling and high critical damage. Daggers can also be wielded as left-handed weapons and used to Parry. Daggers are a great option for those wanting to apply Crystal Magic Weapon and Rotten Pine Resin.",
    "image": "dagger.png",
    "weapons": [
      "1c517164-61dd-4575-80ca-99a89e7791d3",
      "95c65ecb-bd2f-4f11-90ae-c1e2256d2615",
      "c04d2f3e-2ffa-4a27-88ae-9131fcc4ecf1",
      "013ec596-791f-46ff-8cd7-f9fe760387f1",
      "c6c909c7-e9c8-4f7c-a4af-9617dca5c562",
      "4048ea05-c153-4379-9efc-eccf890194cf"
    ],
    "slug": "daggers"
  },
  {
    "id": "c2cb37db64ceb52c66f99515",
    "name": "Gauntlets",
    "description": "Gauntlets are a Weapon Category in Dark Souls and Dark Souls Remastered. Gauntlets have the shortest range among the weapons in the game, forcing players into very close range melee combat. The weapons are extremely fast and consume little stamina, allowing for long combos that can break enemies' guard or deplete their stamina. This strategy is useful in PvE but not in PvP as other players will be able to parry the predictable fast repeating combo. These weapons can be wielded in the left hand or the right hand, each with different effects. Left-handing them grants the ability to parry whilst wielding gauntlets in the right hand will replace the regular kick animation with knee strikes.",
    "image": "claw.png",
    "weapons": [
      "2fb8cdd1-2431-4f37-a1ea-83a2d22b8a34",
      "ab7eeaff-5ef1-41bb-840c-9ccb01e8b049",
      "1dbe9df5-9a27-44d5-9310-abe127be5cc5"
    ],
    "slug": "gauntlets"
  },
  {
    "id": "c1cb37db64cee52c66f99516",
    "name": "Great Hammers",
    "description": "Great Hammers are a Weapon Category in Dark Souls and Dark Souls Remastered.  Great Hammers are among the largest weapons in the game and require very high Strength, to the point they are mostly two-handed. Their heavy weight compounds to deliver large powerful swings, causing staggering and breaking enemy guard. The Large Club has an AOE lunging attack that covers a huge area.",
    "image": "smoughs_hammer.png",
    "weapons": [
      "bc3ede70-7b50-45b7-a10b-2e3a0413e741",
      "5a1e8d81-a16b-4db1-ba00-9e7e5fc171a1",
      "3e039b3a-98fe-4c44-9b93-f2fb4b8ec8e8",
      "acc27aba-0953-4e44-8ab2-6f05e9472fab",
      "d96ecc3d-f393-4680-b9f2-be3666cc134a",
      "cddc654f-9662-4abd-a16a-5d0e98a5fd2c"
    ],
    "slug": "great-hammers"
  },
  {
    "id": "c7cb37db64aee52c66f99510",
    "name": "Great Axes",
    "description": "Great Axes are a Weapon Category in Dark Souls and Dark Souls Remastered. Great Axes are the largest and among the heaviest weapons in the game, requiring the highest strength to wield. Their arc attack motion is very slow and not as wide compared to Axes, with a shorter range and leaving users vulnerable to attacks during attack animations. Despite having short reach, Great Axes deal heavy unblockable damage which will break poise and lead to stunlock when used appropriately. Great Axes can be wielded both one or two-handed. Interestingly, attacks are faster when wielding the weapon one-handed than wielding it two-handed.",
    "image": "black_knight_greataxe.png",
    "weapons": [
      "92f1a959-132c-4104-b3a8-bf7e4b4d45e0",
      "28e0a641-910e-4f82-9bfd-f1db58671d30",
      "ef1f6ca6-e853-4d4c-afbf-b27c3de4d9c0",
      "35f2f986-cf7d-4033-a885-4595a1a4b906",
      "dffc3114-a6d9-4a9e-aaab-2140cbab4036"
    ],
    "slug": "great-axes"
  },
  {
    "id": "c1cb376964cee52c66a99510",
    "name": "Greatswords",
    "description": "Greatswords are a Weapon Category in Dark Souls and Dark Souls Remastered. Greatswords are powerful blades with a wide swing radius and long reaching attacks, enabling the wielder to target multiple opponents within the radius of the swing motion. As a balancing factor, the weapons are considerably heavier, resulting in slower attacks and requiring more stats and more effort to swing. Given the strength and range of these sweeping attacks, Greatswords can stagger enemies long enough to land another strike/hit.",
    "image": "great_lord_greatsword.png",
    "weapons": [
      "418d1c93-5e9a-430b-ac33-58bfe541e99d",
      "4cd9d374-f8ff-476e-a8d6-d289551c0391",
      "e41c1a41-694e-4a3c-b9d6-860f8616ba18",
      "496e20cc-ea6c-4d74-a390-aa085a692326",
      "ae4deb79-4b89-469f-822b-8fc65f6b80db",
      "88388421-0719-436d-a785-635df038637e",
      "ff44d96c-a8d4-4f83-83d9-7a71447c3441",
      "95bc1b9f-43f1-4c04-9a1e-0c8e1601a63a",
      "874e8c97-1b81-4f3e-bc5b-31d4eb0c3247",
      "c08ea542-2a64-457a-9891-e098651327e0",
      "7bccedb4-b572-4070-930b-f174f73423cc",
      "3060f206-fc54-4fc1-8b78-aa977b50914d"
    ],
    "slug": "greatswords"
  },
  {
    "id": "c1cb37db64cee12c66f93510",
    "name": "Halberds",
    "description": "Halberds are a Weapon Category in Dark Souls and Dark Souls Remastered. Halberds are somewhat slower versions of spears with a similar moveset and range. These weapons have powerful attacks with several Damage Types, making them a well-rounded choice for a main weapon. Since Halbers are relatively slow and sweeping in their motions, players should place their attacks carefully to avoid the lengthy recovery times. Halberds can also be paired with items such as the Leo Ring to increase their damage output.",
    "image": "halberd.png",
    "weapons": [
      "13229081-e820-4d75-8ad3-b7a339467859",
      "e3894dc9-fbdd-4509-8860-c175a7d97e27",
      "abe8d331-c46a-45e6-bd06-54ee7ffde70e",
      "b96f1c5e-fae3-4fde-97ab-f964dbaae941",
      "284e9838-b428-4ed3-872a-6c251ebdca7f",
      "05a163b7-2776-4a0e-b4fd-d62ea602214b",
      "415087c3-97fc-4fd9-83a5-ebf0a6d793f5",
      "9bfd2cef-e653-442b-8632-85a0f8a64f26",
      "5ddb2111-9f46-4234-a1fd-00c03ea0b99e"
    ],
    "slug": "halberds"
  },
  {
    "id": "c1cb37db64cee1a166f93510",
    "name": "Hammers",
    "description": "Hammers are a Weapon Category in Dark Souls and Dark Souls Remastered.  Hammers can attack quickly with powerful strikes but have the disadvantage of long recovery times that leave the player open to enemy counters when a hit does not connect. Most of these weapon have 2 basic damage types, strike and thrust attacks. Hammers share attack animations and playstyle with Axes and Great Axes. However, Hammers generally deal higher damage to armored enemies or foes comparing axes, and their blunt force is ideal against skeletons. These weapons focus on a successful first strike, as the force of the heavy blow can break the opponents guard, staggering the enemy and providing an opening for a stunlock combo.",
    "image": "hammer_of_vamos.png",
    "weapons": [
      "fa75b387-3ab0-415d-8ff5-f3c7804f1d9d",
      "5feba7dc-deb5-422e-b6b9-a761963faf6f",
      "c66ab9ac-ad17-40f2-9af1-f71a0ff32adc",
      "cf5f972b-e019-459c-b790-ab9552a91040",
      "09a06124-8bf0-4bf9-bab5-065349c549ad",
      "f2f9c62f-58ce-446a-b623-ae059418a74c",
      "7dbac0b4-6340-4fdd-a9c9-f93840abd9ef",
      "4ff92d3a-1da2-493e-ba37-bab8588780d7",
      "1f6b4ea5-f23a-415b-a325-2b5aa29892de"
    ],
    "slug": "hammers"
  },
  {
    "id": "c1cb37db64cea12c66f99910",
    "name": "Katanas",
    "description": "Katanas are a Weapon Category in Dark Souls and Dark Souls Remastered. Katanas are fast-swinging weapons for their long range of motions. Dealing Slash and Thrust damage, Katanas can also inflict Bleed. The inherent sharpness of the blade has the disadvantage of having low durability. Katanas are primarily Dexterity weapons that can also be wielded as left-handed weapons and used to Parry.",
    "image": "washing_pole.png",
    "weapons": [
      "93674649-211b-4955-82f7-99054457e447",
      "c771989d-1b92-4695-bdbe-d80f68b205b1",
      "7f1a3a0e-7b5e-44d0-b8e2-ce09eccd44b5",
      "e294e491-2012-4b1f-9f6a-b57b9b3aadc3"
    ],
    "slug": "katanas"
  },
  {
    "id": "c0cb37db64cee52c01f91510",
    "name": "Spears",
    "description": "Spears are a Weapon Category in Dark Souls and Dark Souls Remastered. Spears are fast long-reaching weapons that deal Thrust Damage. They are excellent for players who like a defensive approach, as they can attack while blocking. Spears are also good for counter-play as they can be effective for interrupting enemy attacks thanks to being relatively fast. The spear stabbing animation is precise but predictable, making it easy to block and unsuitable to engage against opponents with small hitboxes or high mobility. ",
    "image": "partizan.png",
    "weapons": [
      "fe03e6ec-a222-4051-9af4-60c0dfcf439c",
      "282bd95f-eb6a-46ad-a1d9-3ff9080ff5b2",
      "9fc5adb5-98c6-40bb-a4ce-fc46b6358da7",
      "b05c0ae4-09dc-4966-8f78-7ede2737c58b",
      "1d8f88fc-42da-422a-ad4d-bd9a4d2b3b25",
      "eb041180-721d-4dd2-9781-395c8a630dcc",
      "8739e404-97f5-4ae6-97cd-54104bd60fb7",
      "00298815-9478-4fcf-99ab-afdbff5a516b",
      "56853276-0c88-4600-8728-c2c051374fe8",
      "821bb21f-cc18-49cb-8fe1-648bb3a82a04"
    ],
    "slug": "spears"
  },
  {
    "id": "c0cb37db64cab52c01f91317",
    "name": "Straight Swords",
    "description": "Straight Swords are a Weapon Category in Dark Souls and Dark Souls Remastered. Straight Swords have increased damage and reach, but are relatively slow when compared to Daggers. Although the swing speed is slower, the additional range makes up for it and Straight Swords are a great choice for attacking multiple opponents with one fast swing motion. Higher base physical damage balances out lesser Dexterity Scaling and Critical. Straight Swords are an ideal weapon for those wanting to make a balanced build for attack rating and speed.",
    "image": "broadsword.png",
    "weapons": [
      "9ec40cc7-7e30-4fda-a08f-7a2fed54d0f2",
      "521d93b1-7ecc-4e88-b1dd-613956f33e90",
      "2da2340f-4ee3-4ce2-8ad3-c28c71913512",
      "dc1ff46c-9814-441c-9ac1-350d39c01764",
      "b995f747-a943-47c4-8190-5ced8711242e",
      "f3c575ea-8f88-4379-b13b-9fc0f919efcf",
      "dd00c161-3128-45be-ae67-21752ede100e",
      "13689222-c105-405d-9a5f-eeec1d217436",
      "52c69caa-3fa1-439a-9f62-25995b5d0b7e",
      "909b28c4-a013-473d-bcce-a37f9986b432",
      "01cf3468-898c-4d84-9251-f126a96df564",
      "c59f61a7-97b4-49a6-8f07-db3682b72704"
    ],
    "slug": "straight-swords"
  },
  {
    "id": "c1cb37db64cbe52c66f00114",
    "name": "Piercing Swords",
    "description": "Piercing Swords are a Weapon Category in Dark Souls and Dark Souls Remastered. Piercing Swords are long and thin blades specifically focused on thrust and counter combat. They are a good choice for attacking heavy armored foes, as their attacks will break Poise and deal critical damage. These swords have a unique and fast moveset enables players to execute rapid consecutive attacks, further enhanced by the kick moveset which is a horizontal swipe attack that enable players to reach farther. Piercing Swords can also be wielded in the left-hand, used to parry.",
    "image": "ricards_rapier.png",
    "weapons": [
      "5024b219-90e9-4b5b-a493-2445d25448eb",
      "418ec379-7889-4e27-a5b2-23979723efcb",
      "4d7b6b30-26b7-4839-ac31-c6423a229149",
      "34e29313-7595-4820-ab41-58a7f3fc9251",
      "9fa73754-5696-4f0c-9432-3378dbb5ebd9"
    ],
    "slug": "piercing-swords"
  },
  {
    "id": "c1cb27db63cee99c33f99510",
    "name": "Ultra Greatswords",
    "description": "Ultra Greatswords are a Weapon Category in Dark Souls and Dark Souls Remastered. Ultra Greatswords are meant to be two-handed, as they are very heavy and require considerable Strength to wield. UGS swings are slow  but far-reaching, wide and extremely powerful, capable of stunning enemies caught in the hit. Ultra Greatsword users can therefore perform a stun-lock combos, as long as they have considered each attack wisely: missing leaves the wielder wide open from attacks of the enemy. When one of your hit connects, enemies/foes will be hit for massive damage.",
    "image": "black_knight_greatsword.png",
    "weapons": [
      "aec50587-13bb-4967-9613-9e970dec6f5c",
      "d64eecea-9756-4f2d-a235-61b994f78ddb",
      "7fc683e8-49dd-4f54-a762-c9924b206544",
      "e96c2ee4-50c8-4ccc-b2d2-33397b4d2df2",
      "313ae387-8e3e-4942-a0d1-af925346f38f"
    ],
    "slug": "ultra-greatswords"
  },
  {
    "id": "c1cb37aa64cbe52c66f99510",
    "name": "Whips",
    "description": "Whips are a Weapon Category in Dark Souls and Dark Souls Remastered. Whips are fast, long range weapons that deal decent damage within a large radius. They are capable of stunning targets for a long period of time which makes them good against Skeletons and other agile opponents. Whips can also be used left-handed in order to parry. Despite not being able to do combos, whips are fast enough that each separate swing comes quickly and chains together. These weapons are unique as they cannot be parried, but this comes with the downfall of the wielder not being able to do backstab, riposte, or plunging attacks. A unique aspect of whips is that they don't show any signs of their augmentations until they are performing an attack. This is only useful for PvP.",
    "image": "whip.png",
    "weapons": [
      "331e71d3-39f1-4024-bfec-fbfdd34861e6",
      "ceec49ec-40f6-4b7c-995d-7b4a5f5a382b",
      "59317aaf-61f2-43c4-b847-a9083ed568ee"
    ],
    "slug": "whips"
  }
]
